# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Fast and simple Node.js version manager
brew "fnm"
# Distributed revision control system
brew "git"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# AI Coding Agent IDE
cask "antigravity"
cask "font-fira-code"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Multi-platform web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organised
cask "notion"
# .NET IDE
cask "rider"
# Snip or pin screenshots
cask "snipaste"
# Open-source code editor
cask "visual-studio-code"
