# Modern, maintained replacement for ls
brew "eza"
# Fast and simple Node.js version manager
brew "fnm"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
cask "font-fira-code"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Multi-platform web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organised
cask "notion"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# .NET IDE
cask "rider"
# Snip or pin screenshots
cask "snipaste"
# Open-source code editor
cask "visual-studio-code"
